Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དབུས་ཞེས་བྱ་བ་ནི་ཐོག་མ་དང་ཐ་མ་དག་ལ་ལྟོས་ཏེ་འབྱུང་བའི་ཕྱིར་རོ།
en: A “middle” exists contingent on a beginning and an end.

source: །ཇི་སྟེ་འཁོར་བའི་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ཞིག་མེད་ན་སེམས་ཅན་རྣམས་གང་དུ་འཁོར་བར་འགྱུར་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འཁོར་བར་ནི་གསུངས་ཏེ།
en: But why, if there is no dharma called saṃsāra in some other form in which beings are going through life after life, did the Lord say, “Bhikṣus!

source: དགེ་སློང་དག་འཁོར་བ་འདི་ཐོག་མ་དང་ཐ་མ་མེད་དེ་ཐོག་མའི་མཐའ་མི་སྣང་ངོ་།
en: This saṃsāra has no beginning and no end because no beginning limit appears.

source: །སེམས་ཅན་མ་རིག་པས་བསྒྲིབས་པ་སྲེད་པའི་ཀུན་ཏུ་སྦྱོར་བ་ཅན་རྣམས་ཀུན་ཏུ་རྒྱུག་ཅིང་འཁོར་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ་ཞེ་ན་ཡང་འདི་ལྟར་ལན་བཏབ་པ་འཁོར་བར་འགྱུར་བ་དེ་ཉིད་དོན་དམ་པར་འཐད་པ་མ་ཡིན་ཏེ།
en: Beings obscured by ignorance and bound by craving wander in saṃsāra”? Again, the response is as follows: Being in saṃsāra is itself ultimately not tenable.

source: གལ་ཏེ་འགའ་ཞིག་འཁོར་བར་འགྱུར་ན་ཡང་བརྟག་པ་འམ་མི་རྟག་པ་ཞིག་འཁོར་གྲང་ན་རྟག་པ་ནི་འཁོར་བར་འགྱུར་བར་མི་འཐད་དེ།
en: If somebody is in saṃsāra, is the saṃsāra to be counted as permanent or impermanent? If it is permanent, it is not feasible that somebody is in saṃsāra, because it would be unchanging.

source: འགྱུར་བ་མེད་པའི་ཕྱིར་རོ། །མི་རྟག་པ་ཡང་འཁོར་བར་འགྱུར་བར་མི་འཐད་དེ། སྐད་ཅིག་པ་རྣམས་ནི་དེ་དང་དེ་ཉིད་དུ་ཞིག་སྟེ། ཡང་སྐད་ཅིག་གཉིས་པ་ལ་གཞན་ཁོ་ན་སྐྱེ་བས་དེ་ལ་འཁོར་བ་ག་ལ་ཡོད།
en: Even if it is impermanent, it is not feasible that somebody is in saṃsāra, because each of the instants have perished and are no longer what they were, and the second instant arises as something quite other, so how could there be a saṃsāra there?

source: དེ་བས་ན་འཁོར་བ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་དང་འགག་པའི་རྒྱུན་གྱིས་དངོས་པོས་འདུ་བྱེད་རྣམས་ཀྱི་རྒྱུན་མ་ཆད་པ་ལ་འཁོར་བ་ཞེས་བྱ་བར་བཏགས་ཏེ།
en: Hence saṃsāra is the label given to the unbroken flow of compounded phenomena existing as an extended series of productions and cessations.

source: འདི་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དོ།
en: This is the “emptiness of no beginning and no end.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། འཁོར་བ་དམིགས་སུ་མེད་ཀྱང་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ཆོས་གཞན་དུ་གྱུར་པ་ནི་ཡོད་དོ།
en: Again, the bodhisattvas think, “Even though saṃsāra cannot be apprehended, when dharmas have been transformed, ‘nirvāṇa’ exists.

source: །འགོགས་པའི་བདེན་པ་ནི་མེད་དོ་ཞེས་བརྗོད་པར་མི་ནུས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དགེ་སློང་དག་མ་སྐྱེས་པ་མ་བྱས་པ་མ་བྱུང་བ། འདུས་མ་བྱས་པ་ནི་ཡོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་མངོན་སུམ་དུ་བསྟན་ཏེ།
en: You cannot say the truth of cessation does not exist because the Lord has explicitly taught it with, ‘Bhikṣus, the unproduced, unmade, unoriginated, uncompounded exists,’ and so on.

source: དེ་བས་ན་དོར་བ་མེད་པ་ཡོད་དོ།
en: Hence nonrepudiation exists.”

source: །དོར་བར་བྱ་ཞིང་མེད་པར་བྱ་བའི་ཕྱིར་དོར་བ་ཞེས་བྱ་བ་ནི་ཕུང་པོ་ལྔ་ལ་བྱའོ།
en: Take “the repudiated” as the five aggregates, because they are to be repudiated and they are to be made nonexistent.

source: །དེ་བཞིན་གཤེགས་པ་འོད་སྲུངས་ཀྱི་གསུང་རབ་ལ་ནི་ཕུང་པོ་ལ་དོར་བ་ཞེས་བྱ་བའི་མིང་དུ་བཏགས་སོ།
en: In the sacred words of the Tathāgata Kāśyapa the label the repudiated is given to the five aggregates.

source: །ད་ལྟར་ཡང་དོར་བར་བྱ་བའི་སྲིད་པ་གཅིག་དང་། དོར་བར་བྱ་བའི་སྲིད་པ་ལྔ་ཞེས་ཀྱང་གསུངས་སོ།
en: And now as well “the one suffering existence to be repudiated” and “the five suffering existences to be repudiated” are explained.

source: །དོར་བའི་དངོས་པོ་ཡོད་པ་མ་ཡིན་པ་ལ་དོར་བ་མེད་པ་ཞེས་བྱ་སྟེ།
en: The thing to be repudiated not being there is called nonrepudiation.

source: ཕུང་པོ་གང་དུ་འགགས་པར་གྱུར་པ་དེ་ལ་དོར་བ་མེད་པ་ཞེས་བྱ་སྟེ།
en: Where the aggregates will have stopped is called nonrepudiation. Hence it is cessation.

source: འགོག་པ་ཡིན་ནོ་སྙམ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ། དོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཆོས་ནི་གང་ཡང་ཡོད་པར་མི་རིགས་ཀྱི།
en: The bodhisattvas then determine as follows: It is not correct that there is any “nonrepudiation” phenomenon at all.

source: ཕུང་པོ་མེད་པ་ལ་ནི་དོར་བ་མེད་པ་ཞེས་བྱ་སྟེ། ཕུང་པོ་མེད་པ་དེ་ཡང་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་དངོས་པོ་ཐམས་ཅད་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་གང་གི་བདག་ཉིད་དུ་ཡང་ཆོས་གཞན་དུ་གྱུར་པར་རྣམ་པར་གཞག་མི་ནུས་སོ།
en: The nonexistence of the aggregates is nonrepudiation, and that nonexistence of the aggregates is the nirvāṇa without any aggregates remaining, characterized as the nonexistence of everything. So you cannot make a presentation of it in any way in the form of some other phenomenon.

source: །དེ་བས་ན་དངོས་པོ་མེད་པ་ཞེས་བརྗོད་པ་ནི་མྱ་ངན་ལས་འདས་པ་དང་། འགོག་པ་དང་། འདུས་བྱས་ཐམས་ཅད་ཉེ་བར་ཞི་བ་དང་། དོར་བ་མེད་པ་ལ་སོགས་པའི་རྣམ་གྲངས་རྣམས་ཀྱིས་བརྗོད་དོ།
en: Hence the expression nonexistent thing is an expression synonymous with nirvāṇa, cessation, all compounded phenomena at peace, nonrepudiation, and so on.

source: །ཇི་སྟེ་མྱ་ངན་ལས་འདས་པ་མེད་ན་ཅིའི་ཕྱིར་འདུ་བྱེད་རྣམས་སྐྱེ་བར་མི་འགྱུར།
en: But if nirvāṇa does not exist how will compounded phenomena not arise?

source: དེ་བས་ན་ཕྱིས་འདུ་བྱེད་རྣམས་ཡང་སྐྱེ་བར་འགྱུར་བའི་གཉེན་པོར་གྱུར་པའི་ཆོས་ནི་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ་ཞེ་ན།
en: Therefore, the dharma that counteracts the recurrence of compounded phenomena is nirvāṇa.

source: དེ་ཡང་འཐད་པ་མ་ཡིན་ཏེ།
en: That is not tenable either.

source: འདུ་བྱེད་རྣམས་མྱ་ངན་ལས་འདས་པ་ནི་ཇི་ལྟར་ཡང་མི་སྲིད་དོ།
en: How could there ever be compounded phenomena that have passed into nirvāṇa?

source: །གལ་ཏེ་འདུ་བྱེད་རྣམས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ན་ཡང་རྟག་པའམ། མི་རྟག་པ་ཞིག་མྱ་ངན་ལས་འདའ་གྲང་ན།
en: If compounded phenomena do pass into nirvāṇa, it must be reckoned some permanent or impermanent thing is passing into nirvāṇa.

source: གལ་ཏེ་རྟག་པ་འགའ་ཞིག་མྱ་ངན་ལས་འདའོ་ཞེས་བྱ་བར་ནི་དེ་ཡང་མི་འཐད་དེ།
en: If you say “something permanent is passing into nirvāṇa,” that is untenable.

source: རྟག་པ་ནི་དུས་ཐམས་ཅད་དུ་འགྱུར་བ་མེད་པ་དང་། དེ་ལ་མྱ་ངན་ལས་འདས་པ་དགོས་པ་མེད་པའི་ཕྱིར་རོ།
en: Something permanent never changes, and there is no need for it to pass into nirvāṇa.

source: །ཇི་སྟེ་འགའ་ཞིག་མྱ་ངན་ལས་འདའོ་ཞེས་བྱ་བར་ནི་དེ་མི་རྟག་པའི་ཕྱིར་ཞིག་པ་ལས་ཕྱིས་སྐྱེ་བ་མེད་དེ།
en: If you say “something impermanent is passing into nirvāṇa,” it would be impermanent; therefore, since it would have been destroyed it would not arise again.

source: སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ལ་ནི་མྱ་ངན་ལས་འདའ་བས་ཅི་ཡང་བྱར་མེད་དོ།
en: And passing into nirvāṇa does nothing to an entity that does not arise.

source: །ཇི་སྟེ་འདུ་བྱེད་གཞན་དག་དེའི་རྒྱུ་ལ་སྐྱེ་བའི་གཉེན་པོར་བྱེད་དོ་ཞེ་ན་ཡང་། དེ་ཡང་ཡོད་པ་མ་ཡིན་ཏེ།
en: And even if you say that nirvāṇa acts to counteract the other compounded phenomena that are the cause of its arising, they are also not there.

source: འཇིག་རྟེན་ལས་འདས་པའི་ལམ་གྱི་མེས་ཉོན་མོངས་པའི་ཤིང་གི་ས་བོན་སྲེག་པའི་ཕྱིར་ཡང་མི་སྐྱེ་བའི་ངོ་བོ་ཉིད་དེ།
en: It is the fire of the extraordinary path that burns the seed of the tree of ignorance into an entity that will not arise again.

source: ངོ་བོ་ཉིད་ཀྱིས་མི་སྐྱེ་བ་དེ་ལ་མྱ་ངན་ལས་འདས་པའོ་ཞེས་བཏགས་སོ།
en: Not arising in its nature—that is labeled nirvāṇa.

source: །ཉན་ཐོས་ཀྱི་ཚུལ་ལ་ཡང་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ཆོས་གཞན་དུ་གྱུར་པ་ཅི་ཡང་མེད་ན་སྟོང་པ་ཉིད་ཀྱི་ཚུལ་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ་འདི་ནི་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: And if even in the śrāvaka system there is no “nirvāṇa” at all in the form of some other dharma, it goes without saying there is none in the emptiness system. This realization is the “emptiness of nonrepudiation.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཡིན་ན། གང་སེམས་ཅན་རྣམས་ཀྱི་རང་བཞིན་དུ་གྱུར་པ་འདོད་ཆགས་ལ་སོགས་པའི་སྤྱོད་པ་དང་། བསམ་པ་དང་། བག་ལ་ཉལ་དང་། མོས་པ་དང་། ཁམས་དང་། རིགས་ཞེས་བྱ་བ་ལ་སོགས་པ་གང་དག་གི་དབང་གིས་བསམ་པ་དང་། བག་ལ་ཉལ་སྣ་ཚོགས་མཁྱེན་པ་དང་། མོས་པ་སྣ་ཚོགས་མཁྱེན་པ་དང་། ཁམས་སྣ་ཚོགས་མཁྱེན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་འཇུག་པར་འགྱུར་བའི་ཆོས་གང་ཡིན་པ་དེ་དག་འཐད་པར་མི་འགྱུར་ཏེ།
en: Again, the bodhisattvas think, “If all attributes are empty it is untenable that, based on the behaviors and thoughts, instincts, interests, dispositions, and personality types— needy and so on—constituting the basic nature of beings, the knowledge of various dispositions, the knowledge of various interests, the knowledge of various basic personalities and so on that are the special attributes of a buddha become operational attributes.

source: དེ་བས་ན་རང་བཞིན་གྱི་ཆོས་དེ་དག་ནི་དོན་དམ་པར་ཡོད་དོ་སྙམ་ནས།
en: Therefore, those attributes of a basic nature ultimately exist.”

source: ཡང་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ། དེ་དག་ནི་ཆོས་གཞན་དུ་གྱུར་པར་བརྗོད་པར་མི་རིགས་ཀྱི། འདི་ལྟར་དེ་དག་ནི་སེམས་ཅན་ཀྱི་རྒྱུད་དུ་གྱུར་པའི་གནས་སྐབས་ཀྱི་བྱེ་བྲག་རྣམས་ཏེ།
en: The bodhisattvas then determine as follows: It is not right to describe them as attributes like that in the form of something quite other, because they are particular periods in a being’s continuum.

source: དེ་དག་ནི་སེམས་ཅན་རྣམས་ལས་ཐ་དད་པའམ་ཐ་དད་པ་མ་ཡིན་པར་རྣམ་པར་གཞག་མི་ནུས་སོ།
en: They cannot be established as different or not different from the beings.

source: །དེ་བས་ན་ཆོས་གཞན་དུ་གྱུར་པ་དེ་ལྟ་བུ་དག་ནི་མེད་དོ་སྙམ་པ་འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Therefore this—thinking that such hypostatized attributes do not exist—is the “emptiness of a basic nature.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་མེད་པ་ཡིན་ན་དེ་དག་གི་མི་རྟག་པ་ཉིད་དང་། སྡུག་བསྔལ་བ་ཉིད་དང་བདག་མེད་པ་ཉིད་ལ་སོགས་པའི་ཆོས་དེ་དག་ཇི་ལྟར་ཡོད་པར་འགྱུར།
en: Again, the bodhisattvas think, “If all things are nonexistent, how can those attributes of them—impermanence, suffering, selflessness, and so on—exist?

source: ཆོས་ཅན་མེད་པར་ནི་ཆོས་ཡོད་པར་མི་རུང་སྟེ།
en: It is impossible to have an attribute without an attribute possessor.

source: འདི་ལྟར་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་མི་རྟག་པའོ། །ཟག་པ་དང་བཅས་པའི་ཆོས་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བའོ། །ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །དེ་ལྟ་བས་ན་དེ་དང་དེ་མཐོང་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་ཐོབ་པ་དང་། སྲིད་པ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ལས་རྣམ་པར་ཐར་པ་འགྲུབ་པོ་སྙམ་ནས།
en: Thus, all compounded things are impermanent; all things with outflows are suffering; all things are selfless, and when that perfect knowledge of reality is seen and attained, freedom from the suffering of all existences is established.”

source: ཡང་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ། མི་རྟག་པ་ཉིད་ཀྱི་ཆོས་འདི་ནི་དོན་དམ་པའི་ཆོས་སུ་མི་རུང་སྟེ།
en: The bodhisattvas then determine as follows: The impermanence attribute and so on cannot be the ultimate attribute.

source: དོན་དམ་པའི་ཆོས་མི་རྟག་པ་དང་། སྐྱེ་བ་དང་འཇིག་པར་ཇི་ལྟར་འགྱུར།
en: How could an ultimate attribute be impermanent, arise, and be destroyed?

source: འགྱུར་བ་དང་རྣམ་པར་འགྱུར་བའི་ཆོས་ནི་དོན་དམ་པ་ཞེས་བྱར་མི་རུང་གི །
en: An attribute that changes and transforms cannot be an “ultimate.”

source: བདེན་པ་གང་ཡིན་པ་དང་། ཕྱིན་ཅི་མི་ལོག་པ་གང་ཡིན་པ་དེ་ནི་དེ་དག་གི་དོན་དམ་པ་ཉིད་དོ།
en: Just that which is true, that which is unmistaken, is their ultimate.

source: །དེ་བས་ན་དོན་དམ་པ་ལ་འགྱུར་བ་དང་ལྡན་པ་མེད་དོ།
en: Therefore the ultimate does not change and nothing inheres in it.

source: །དེ་བཞིན་དུ་གལ་ཏེ་སྡུག་བསྔལ་དུ་གྱུར་པའི་ཆོས་དོན་དམ་པར་གྱུར་པ་ཞིག་ཡོད་ན་ནི་དེ་ལྟ་ན་སྡུག་བསྔལ་དེ་རྟག་པར་འགྱུར་ཏེ།
en: Similarly, if an attribute in the form of suffering that serves as an ultimate were to exist then suffering would be permanent.

source: དེ་ལྟར་གྱུར་ན་རྟག་པར་གྱུར་པའི་སྡུག་བསྔལ་ནི་དུས་ཐམས་ཅད་དུ་ཡོད་པའི་ཕྱིར་འཇིག་རྟེན་ནམ། འཇིག་རྟེན་ལས་འདས་པའི་བདེ་བ་ཡང་སྐྱེ་བར་མི་འགྱུར་རོ།
en: And in that case, because the permanent suffering would always be there, ordinary or extraordinary happiness would never arise again.

source: །དེ་བཞིན་དུ་གལ་ཏེ་བདག་མེད་པ་ཞེས་བྱ་བའི་ཆོས་ཤིག་དོན་དམ་པར་ཡོད་པར་འགྱུར་ན། འོ་ན་ནི་ཆོས་ཐམས་ཅད་བདག་མེད་པ་ཉིད་དང་ལྡན་པས་རྟག་པར་འགྱུར་རོ།
en: Similarly, if a “selfless” attribute existed as the ultimate then selflessness would inhere in all things and they would become permanent.

source: །དེ་ལྟར་གྱུར་ན་ཐར་པ་ཞེས་བྱ་བ་ཉིད་འགྲུབ་པར་མི་འགྱུར་རོ།
en: And were they to have become so, “liberation” would not be a state to be accomplished.

source: །དེ་བས་ན་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་འདི་དག་ནི་ཀུན་བརྟགས་པ་ཉིད་ཡིན་ཏེ།
en: Therefore, these basic natures of imaginary phenomena are just imaginary.

source: ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་ནི་གཞིག་པར་མི་ནུས་སོ།
en: The emptiness of all dharmas is not something that can be examined.

source: །དེ་བས་ན་འདི་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Hence this is the “emptiness of all dharmas.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་རེ་ཞིག་མི་རྟག་པ་ཉིད་ལ་སོགས་པ་ནི་སྤྱིའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་མེད་དུ་ཟིན་ཀྱང་འདི་དག་ནི་ཆོས་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་དེ་གཟུགས་ཀྱི་མཚན་ཉིད་ནི་གཟུགས་སུ་རུང་བའོ། །ཚོར་བའི་མཚན་ཉིད་ནི་མྱོང་བའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དེ་དག་ནི་ཡོད་དོ།
en: Again, the bodhisattvas think, “Even if, for the time being, impermanence and so on do not, as general characterizing marks, exist, still those marks particular to something—‘easily breakable,’ ‘seeable’ that is the mark of a form or physical object, ‘experience’ that is the mark of feeling, and so on—do exist.

source: །དེ་དག་ཡོད་པས་གཟུགས་ལ་སོགས་པ་ཡང་ཡོད་པ་ཉིད་དོ་སྙམ་ནས།
en: Since they exist, form and so on also exist.”

source: ཡང་བདག་ཉིད་ཀྱིས་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ། ཅི་མཚན་ཉིད་འདི་དག་མཚན་ཉིད་ཀྱི་གཞི་རྣམས་ལས་ཐ་དད་དམ། འོན་ཏེ་ཐ་དད་པ་མ་ཡིན།
en: They then determine as follows: Are these marks different from the bases of the marks or not different?

source: གལ་ཏེ་ཐ་དད་པ་མ་ཡིན་པར་གྱུར་ན་དེ་ཉིད་མཚན་ཉིད་ཡིན་ལ། དེ་ཉིད་མཚན་ཉིད་ཀྱི་གཞི་ཡིན་ཞེས་བྱར་མི་རུང་སྟེ། མཚན་ཉིད་ཀྱི་གཞི་མ་གྲུབ་ན་མཚན་ཉིད་ཀྱང་དེ་དང་ཐ་དད་པ་མ་ཡིན་པས་གྲུབ་པར་མི་འགྱུར་ཏེ།
en: If they are not different, it is not correct that “just that is the mark, and just that is the basis of the marks,” because if the basis of a mark is not established, the mark is not different than that and hence is not established.

source: དེའི་མཚན་ཉིད་དུ་ཇི་ལྟར་གྲུབ་པར་འགྱུར།
en: How could it be established as its mark?

source: གལ་ཏེ་ཐ་དད་པར་གྱུར་ན་དེ་ལྟ་ན་ནི་འདི་དཔྱད་དགོས་ཏེ། ཅི་མཚན་ཉིད་ཀྱི་གཞིའི་སྔོན་རོལ་དུ་མཚན་ཉིད་བྱུང་ངམ། འོན་ཏེ་ཕྱིས་འབྱུང་ངམ་འོན་ཏེ་དུས་གཅིག་ཏུ་བྱུང་།
en: If they are different, then the following investigation has to be pursued: Does the mark exist before the basis of the mark, or does it come about afterward, or are they there at the same time?

source: གལ་ཏེ་མཚན་ཉིད་ཀྱི་གཞིའི་སྔོན་རོལ་དུ་མཚན་ཉིད་བྱུང་ན་མཚན་ཉིད་ཀྱི་གཞི་མེད་པར་དེ་གང་གི་མཚན་ཉིད་ཡིན།
en: If the mark is there before the basis of the mark, then of what, in the absence of the basis of the mark, is it the mark?

source: གཞི་མེད་པར་མཚན་ཉིད་འབའ་ཞིག་སྔར་བྱུང་བར་གྱུར་ན་ཕྱིས་ཀྱང་གཞི་མེད་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རོ།
en: If just a mark without a basis exists there before, then later on it will be without a basis as well.

source: །ཇི་སྟེ་མཚན་ཉིད་ཀྱི་གཞི་ནི་སྔར་བྱུང་ལ་མཚན་ཉིད་ཕྱིས་བྱུང་བར་གྱུར་ན་དེ་ལྟ་ན་ནི་མཚན་ཉིད་བྱུང་བའི་སྔོན་རོལ་དུ་མཚན་ཉིད་ཀྱི་གཞི་དེ་མཚན་ཉིད་མེད་པར་བྱུང་བས་ཕྱིས་ཀྱང་མཚན་ཉིད་མེད་པར་ཅིའི་ཕྱིར་མི་འབྱུང་།
en: If the basis of the mark is there before and the mark comes about later, in that case the basis of the mark comes about without a mark before the mark is there, so why would it not be without a mark afterward as well?

source: མཚན་ཉིད་མེད་པར་མཚན་ཉིད་ཀྱི་གཞི་སྔར་བྱུང་དུ་ཟིན་ན་ཕྱིས་མཚན་ཉིད་འབྱུང་བའི་ཚེ་རྒྱུ་མེད་པར་འབྱུང་བར་གྱུར་པས་མཚན་ཉིད་དེ་ཅི་ཡང་མི་བྱེད་པར་འགྱུར་རོ།
en: If the basis of the mark without a mark is already there before, later when it gets the mark, having come about without cause that mark will serve no function at all.

source: །ཇི་སྟེ་མཚན་ཉིད་ཀྱི་གཞི་དང་མཚན་ཉིད་དུས་གཅིག་ཏུ་འབྱུང་བར་གྱུར་ན། དེ་ལྟ་ན་ནི་མཚན་ཉིད་ལས་མཚན་གྱི་གཞི་ཐ་དད་པར་གྱུར་པ་དང་། མཚན་གྱི་གཞི་ལས་མཚན་ཉིད་ཐ་དད་པར་གྱུར་པ་སྔར་མ་མཐོང་བའི་ཕྱིར་འདི་ནི་མཚན་ཉིད་དོ།
en: If the basis of the mark and the mark have come about at the same time, then that is a new discovery indeed—a basis of the mark that is different from the mark, and a mark that is different from the basis of the mark.

source: །འདི་ནི་མཚན་ཉིད་ཀྱི་གཞིའོ་ཞེས་གཉིས་སུ་རྣམ་པར་དབྱེ་བ་ཇི་ལྟར་རིགས་པར་འགྱུར།
en: So how could the bifurcation “this is the mark; this is the basis of the mark” be right?

source: དེ་བས་ན་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམས་ཀྱང་ཀུན་བརྟགས་པ་ཉིད་ཡིན་པས་དོན་དམ་པར་རྟག་བཟོད་པ་མ་ཡིན་ནོ་སྙམ་པ་འདི་ནི།
en: Therefore, the marks of imaginary dharmas are just falsely imagined, and hence unable to bear ultimate scrutiny.

source: །རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དོ།
en: This is the “emptiness of its own mark.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་ཡིན་ན། དེ་ལྟ་ན་ནི་དམིགས་སུ་མེད་པའི་ཆོས་གཞན་དུ་གྱུར་པ་ཞིག་ཡོད་དོ།
en: Again, the bodhisattvas think, “If all attributes cannot be apprehended, in that case an attribute that cannot be apprehended in the form of something quite other would exist.

source: །གལ་ཏེ་དམིགས་སུ་མེད་པ་མེད་དུ་ཟིན་ན་ཆོས་རྣམས་དམིགས་སུ་ཡོད་པར་འགྱུར་ཏེ།
en: If that which cannot be apprehended is taken to be nonexistent then all attributes can be apprehended.

source: དེ་བས་ན་དམིགས་སུ་མེད་པ་ནི་ཡོད་དོ་སྙམ་ནས་ཡང་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ།
en: Therefore, what cannot be apprehended does exist.”

source: འདི་ལ་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ནི་ཡོད་པར་མི་རིགས་སོ།
en: They then determine as follows: It is not correct that an attribute that cannot be apprehended in the form of something quite other exists.

source: །གལ་ཏེ་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ཞིག་ཡོད་ན་ནི་དམིགས་སུ་མེད་པ་དེ་ལས་གུད་ན་དམིགས་པ་ཡང་ཡོད་པར་འགྱུར་རོ།
en: If the attribute called “cannot be apprehended” in the form of something quite other exists, an apprehending apart from that which cannot be apprehended would also exist.

source: །དེའི་ཕྱིར་དམིགས་སུ་མེད་པ་ནི་དམིགས་པའི་ངོ་བོ་ཉིད་དུ་འགྱུར་རོ། །དེ་ཡང་བཀག་པའི་ཕྱིར་དེ་ལྟར་མི་རུང་སྟེ།
en: On account of that, that which cannot be apprehended would become an apprehended entity.

source: དེ་ཉིད་དམིགས་པ་ཡིན་ལ་དེ་ཉིད་དམིགས་སུ་མེད་པ་ཡིན་ནོ་ཞེས་བྱ་བ་འདི་ནི་འགལ་ལོ།
en: And that is unsuitable because it stands negated—to be itself apprehended and to be itself something that cannot be apprehended is a contradiction.

source: །ཇི་སྟེ་ཡང་འདི་སྙམ་དུ་དམིགས་སུ་མེད་པ་ལ་ནི་དམིགས་པ་ཡོད་པ་མ་ཡིན་ནོ་སྙམ་དུ་སེམས་ན་ཡང་། དེ་ལྟ་ན་ནི་དམིགས་སུ་མེད་པའི་ཕྱིར་དམིགས་སུ་མེད་པ་ཡང་མེད་པ་ཉིད་དུ་འགྱུར་རོ།
en: And even if it is thought, in regard to what cannot be apprehended, that apprehending is not there, in that case what cannot be apprehended also, because it cannot be apprehended, is just nonexistent.

source: །དེའི་ཕྱིར་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ཡོད་དོ་ཞེས་བྱ་བ་མི་དམིགས་ཀྱི། ཆོས་རྣམས་ཀྱི་དམིགས་པ་མེད་པ་ཉིད་ལ་དེ་དང་དེར་དམིགས་སུ་མེད་པ་ཞེས་ཐ་སྙད་བཏགས་པ་འབའ་ཞིག་ཏུ་ཟད་དེ།
en: Therefore there is no apprehending of “an attribute that ‘cannot be apprehended’ in the form of something quite other exists”; rather, given the fact that attributes cannot be apprehended, that is merely labeling “it cannot be apprehended” onto this or that.

source: དེ་བས་ན་འདི་ནི་མི་དམིགས་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Therefore, this is the “emptiness of not apprehending.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ་ཞེས་བཤད་དེ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པ་ཞེས་བྱ་བའི་ངོ་བོ་ཉིད་བཅལ་བར་བྱའོ།
en: Again, the bodhisattvas think, “It has been explained that “all dharmas are in their intrinsic nature nonexistent things,” so the intrinsic nature of a ‘nonexistent thing’ as it pertains to every dharma has to be searched for.

source: །དེ་བས་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་གྲུབ་པའི་ཕྱིར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཅེས་བྱ་བའི་ཆོས་ནི་ཡོད་དོ།
en: Therefore, because it is established as being in its intrinsic nature a nonexistent thing, a dharma ‘in its intrinsic nature a nonexistent thing’ exists.

source: །ཇི་སྟེ་འདི་སྙམ་དུ་གལ་ཏེ་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་བདག་ཉིད་ཡིན་ན། དེ་ལྟར་ན་ནི་ཆོས་རྣམས་མེད་དོ་ཞེས་བྱ་བ་ཉིད་དུ་གསུང་བར་འགྱུར་ཏེ། འདི་ལ་རྙེད་པ་ཅི་ཞིག་ཡོད་སྙམ་སེམས་ན།
en: But if it is thought, ‘If dharmas are things that are nonexistent in their nature, then one would be saying “dharmas do not exist,” and what gain would there be in that?’

source: དེ་ལྟ་ཡང་མ་ཡིན་ཏེ།
en: it is not so.

source: ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་དོ་ཞེས་ཁས་བླངས་ན། ཀུན་བརྟགས་པའི་ཆོས་དེ་དག་ཉིད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡོད་དོ་ཞེས་སྨྲས་པས་ཆོས་རྣམས་ཀྱི་ཕྱོགས་གཅིག་ཡོད་པར་བསྟན་པར་འགྱུར་བས་རྙེད་པ་ཆེར་ཡོད་དོ་སྙམ་ནས་ཡང་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ།
en: There is a great gain because, when it has been accepted that ‘all falsely imagined dharmas are nonexistent in each and every way,’ it is being said that just those falsely imagined dharmas are there as the intrinsic nature of nonexistent things, so it becomes an explanation of the existence of one side of dharmas.”

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ་ཞེས་བྱ་བའི་ཚིག་འདིའི་དོན་གང་ཡིན་ཞེ་ན།
en: They then determine as follows: What is the meaning of this statement, “all dharmas are in their intrinsic nature nonexistent things”?

source: ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་འདིས་ནི་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་དང་། ཡོངས་སུ་གྲུབ་པའི་ཆོས་རྣམས་བསྟན་ཏོ།
en: This “all dharmas” teaches falsely imagined dharmas and thoroughly established dharmas.

source: །དེ་ལ་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ནི་མེད་པའི་ཕྱིར་ཤིན་ཏུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ་ཞེས་བརྗོད་དོ།
en: Among these, falsely imagined dharmas do not exist, so it is said they are “in their intrinsic nature absolutely nonexistent things.”

source: །ཡོངས་སུ་གྲུབ་པའི་ཆོས་རྣམས་ནི་དེ་བཞིན་ཉིད་དངོས་པོ་ལས་བཟློག་པའི་རྣམ་པ་སྟེ།
en: Thoroughly established dharmas are suchness in the aspect of existent things when they have been stopped.

source: དངོས་པོ་མེད་པ་ཞེས་བྱ་བའི་དོན་འདི་བཟུང་ནས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཅེས་བྱའོ།
en: So, taking “nonexistent thing” in this sense, it says “in its intrinsic nature a nonexistent thing.”

source: །བྱུང་བའི་ཕྱིར་དངོས་པོ་ཞེས་བྱ་བས་ན་འདུས་བྱས་ཀྱི་ཆོས་ལ་དངོས་པོ་ཞེས་བྱའོ།
en: An “existent thing” is so called because it has come into being. Hence a compounded phenomenon is called an “existent thing.”

source: །དེ་ལས་བཟློག་པ་བརྗོད་དུ་མེད་པ་སོ་སོ་རང་གིས་རིག་པའི་རྣམ་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། དེ་བཞིན་ཉིད་ཅེས་བྱ་བར་བསྟན་ཏོ།
en: When it has stopped, that which is the inexpressible aspect of private self-awareness is called “the intrinsic nature when there is no existent thing,” taught as “suchness.”

source: །དེ་ལྟར་ན་འདི་ཉིད་ཀྱིས་ཆོས་རྣམས་ཀྱི་ཡོད་པ་དང་། མེད་པ་བསྟན་པ་ཡིན་ཏེ།
en: In that way, with just this, the existence and the nonexistence of all dharmas have been explained.

source: གང་གི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་གང་ན་གང་མེད་པ་དེ་ན་དེས་སྟོང་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། དེ་ན་ལྷག་མ་མ་ལུས་པ་གང་ཡིན་པ་དེ་ནི་འདིར་ཡོད་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་གསུངས་པས་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཤིན་ཏུ་རྟོགས་པ་མ་ཡིན་ཏེ།
en: And because the Lord has said, “They see perfectly that that in which something does not exist is empty of it, they know perfectly about that which is still left over in it, that ‘it is here,’ ” therefore the characteristic mark of all dharmas—that they are in their intrinsic nature nonexistent—is absolutely not realized.

source: འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is “the emptiness of the nonexistence of an intrinsic nature.” “

source: །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་དང་།
en: The suchness of all dharmas, the suchness of the dharma-constituent, and the suchness of the very limit of reality”— it is true that suchness is always one.

source: ཡང་དག་པའི་མཐའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ནི་ཐམས་ཅད་དུ་ཡང་དེ་བཞིན་ཉིད་ནི་གཅིག་མོད་ཀྱི་འོན་ཀྱང་དེའི་གཞི་ལ་འཇུག་པ་ཐ་དད་པས་རྣམ་པ་གསུམ་དུ་གཞག་སྟེ། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ས་པ་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ས་པའོ།
en: Nevertheless, it is presented as three in reference to its different bases: at the level of the knowledge of path aspects, at the level of the knowledge of all aspects, and at the all-knowledge level.
